file_path = "./Crop_Words/target_log_demo_result_vgg.txt"

text_list = ['101', '102', '103', '104', '105', '106', '107', '108', '109', '110', '201', '202', '203', '204', '205', '206', '207', '208', '209', '210', '301', '302', '303', '304', '305', '306', '307', '308', '309', '310', '401', '402', '403', '404', '405', '406', '407', '408', '409', '410', '101호', '102호', '103호', '104호', '105호', '106호', '107호', '108호', '109호', '110호', '201호', '202호', '203호', '204호', '205호', '206호', '207호', '208호', '209호', '210호', '301호', '302호', '303호', '304호', '305호', '306호', '307호', '308호', '309호', '310호', '401호', '402호', '403호', '404호', '405호', '406호', '407호', '408호', '409호', '410호',]

with open(file_path) as f:
    lines  = f.readlines()

for line in lines:
    item = line.split()
    
    try:
        text = item[1]
    except:
        continue

    for label in text_list:
        if(text == label):
            with open("result.txt", 'w') as fi :
                fi.write(text.strip("호"))

